Repository: vdelachaux/bag4D
Catalog: bag4D.4dbase/Resources/*.lproj/bag4D.xlf
Languages: fr

# Errors_thisContainerDoesntExist
source: This value bag doesn't exist
fr: Ce conteneur n'existe pas

# Errors_missingParameter
source: Missing parameter
fr: Paramètre manquant

# Errors_theItemExistsButWithAnOtherType{type}
source: The item exists, but with an other type ({type})
fr: L'élément existe, mais avec une autre type ({type})

# Errors_theItem{tag}DoesNotExist
source: The item "{tag}" does not exist.
fr: L'item "{tag}" n'existe pas.

# Errors_internalError
source: Internal error
fr: Erreur interne

# Errors_thePointerCantBeAPointerToALocalVariable
source: The pointer can't be a pointer to a local variable
fr: Le pointeur ne peut pas être un pointeur vers une variable locale

# Errors_theItem{tag}IsNotAnArray
source: The item "{tag}" is not an array.
fr: L'élément "{tag}" n'est pas un tableau

# Errors_theTypeOfArrayIsNotCompatibleWithTheValueToStore
source: The type of array is not compatible with the value to store
fr: Le type du tableau n'est pas compatible avec la valeur à stocker

# Errors_theArrayIndexIsOutOfBounds
source: The array index is out of bounds
fr: L'indice du tableau est en dehors des limites

# Errors_invalidPathname
source: Invalid pathname
fr: Chemin d'accès invalide

# Errors_aLevelInThePathnameIsNotValid
source: A level in the pathname is not valid
fr: Un niveau dans le chemin d'accès n'est pas valide

# Errors_thisTypeOfArrayIsNotManaged
source: This type of array is not managed
fr: Ce type de tableau n'est pas pris en charge

# Errors_theItem{tag}IsNotABlob
source: The item "{tag}" is not a blob.
fr: L'élément "{tag}" n'est pas un blob

# Errors_theItem{tag}IsNotAPointer
source: The item "{tag}" is not a pointer.
fr: L'élément "{tag}" n'est pas un pointeur

# Warning_divisionByZero
source: Division by zero
fr: Division par zéro

# Warning_operatorNotSupportedForThisTypeOfData
source: Operator not supported for this type of data
fr: Opérateur non pris en charge pour ce type de données
